{"11pt": 0, "paper": 1, "amssymb": 2, "amsmath": 3, "enumerate": 4, "theorem": 5, "epsfig": 6, "rotating": 7, "graphics": 8, "changebar": 9, "eepic": 10, "amsfonts": 11, "a4": 12, "latexsym": 13, "parskip": 14, "hyperref": 15, "pdfauthor": 16, "ms": 17, "pdftitle": 18, "fields": 19, "amsfont": 20, "field": 21, "graphic": 22, "p": 23, "a": 24, "1": 25, "4": 26, "h": 27, "_": 28, "2": 29, "3": 30, "c": 31, "q": 32, "n": 33, "r": 34, "f": 35, "z": 36, "m": 37, "o": 38, "s": 39, "j": 40, "ns": 41, "break": 42, "proposition": 43, "lemma": 44, "corollary": 45, "korollar": 46, "remark": 47, "question": 48, "conjecture": 49, "observation": 50, "criterion": 51, "example": 52, "examples": 53, "definition": 54, "headings": 55, "heading": 56, "document": 57, "1cm": 58, "k3": 59, "surfaces": 60, "with": 61, "picard": 62, "rank": 63, "20": 64, "surface": 65, "matthias": 66, "sch": 67, "utt": 68, "matthia": 69, "we": 70, "determine": 71, "all": 72, "complex": 73, "over": 74, "here": 75, "the": 76, "eron": 77, "severi": 78, "group": 79, "has": 80, "and": 81, "is": 82, "generated": 83, "by": 84, "divisors": 85, "which": 86, "are": 87, "defined": 88, "our": 89, "proof": 90, "uses": 91, "modularity": 92, "artin": 93, "tate": 94, "class": 95, "theory": 96, "different": 97, "techniques": 98, "result": 99, "been": 100, "established": 101, "elkies": 102, "to": 103, "show": 104, "that": 105, "mordell": 106, "weil": 107, "18": 108, "impossible": 109, "for": 110, "an": 111, "elliptic": 112, "then": 113, "apply": 114, "methods": 115, "general": 116, "singular": 117, "i": 118, "e": 119, "of": 120, "but": 121, "not": 122, "necessarily": 123, "divisor": 124, "elky": 125, "method": 126, "technique": 127, "us": 128, "multiplication": 129, "modular": 130, "form": 131, "msc": 132, "2000": 133, "14j28": 134, "11f11": 135, "11g15": 136, "11g25": 137, "11r29": 138, "introduction": 139, "geometric": 140, "number": 141, "called": 142, "since": 143, "they": 144, "involve": 145, "no": 146, "moduli": 147, "share": 148, "many": 149, "properties": 150, "curves": 151, "cm": 152, "instance": 153, "can": 154, "always": 155, "be": 156, "some": 157, "moreover": 158, "finite": 159, "extension": 160, "series": 161, "given": 162, "in": 163, "terms": 164, "hecke": 165, "characters": 166, "cf": 167, "thm": 168, "si": 169, "\\\\in": 170, "alway": 171, "character": 172, "curve": 173, "property": 174, "sery": 175, "term": 176, "livn": 177, "proved": 178, "motivic": 179, "l": 180, "however": 181, "this": 182, "does": 183, "require": 184, "refer": 185, "particular": 186, "as": 187, "doe": 188, "thi": 189, "motivation": 190, "study": 191, "such": 192, "was": 193, "following": 194, "shioda": 195, "raised": 196, "whether": 197, "it": 198, "possible": 199, "have": 200, "one": 201, "way": 202, "disprove": 203, "would": 204, "do": 205, "exist": 206, "turned": 207, "out": 208, "there": 209, "see": 210, "ex": 211, "19": 212, "7": 213, "recently": 214, "determined": 215, "these": 216, "their": 217, "transcendental": 218, "lattices": 219, "lattice": 220, "let": 221, "primitive": 222, "using": 223, "sphere": 224, "packings": 225, "gluing": 226, "up": 227, "niemeier": 228, "concluded": 229, "packing": 230, "conversely": 231, "model": 232, "section": 233, "existence": 234, "present": 235, "alternative": 236, "hope": 237, "independent": 238, "interest": 239, "ingredients": 240, "plus": 241, "classification": 242, "forms": 243, "reduction": 244, "at": 245, "split": 246, "primes": 247, "ingredient": 248, "plu": 249, "prime": 250, "generalise": 251, "deduce": 252, "obstruction": 253, "denote": 254, "discriminant": 255, "contains": 256, "ring": 257, "contain": 258, "enables": 259, "give": 260, "direct": 261, "safarevi": 262, "finiteness": 263, "oo": 264, "only": 265, "known": 266, "other": 267, "than": 268, "on": 269, "genus": 270, "eq": 271, "cl": 272, "lem": 273, "private": 274, "correspondence": 275, "informed": 276, "author": 277, "his": 278, "also": 279, "generalises": 280, "enable": 281, "generalis": 282, "genu": 283, "organised": 284, "follows": 285, "next": 286, "two": 287, "sections": 288, "recall": 289, "relevant": 290, "facts": 291, "about": 292, "explicit": 293, "introduces": 294, "main": 295, "used": 296, "presented": 297, "k": 298, "prim": 299, "converse": 300, "statement": 301, "covered": 302, "continue": 303, "isomorphism": 304, "quad": 305, "quadratic": 306, "concludes": 307, "case": 308, "conclude": 309, "fact": 310, "follow": 311, "introduce": 312, "sing": 313, "invariant": 314, "its": 315, "consider": 316, "algebraic": 317, "equivalence": 318, "cup": 319, "product": 320, "orthogonal": 321, "complement": 322, "first": 323, "stated": 324, "pjatecki": 325, "sapiro": 326, "pss": 327, "completed": 328, "inose": 329, "\\\\prod": 330, "torelli": 331, "map": 332, "gives": 333, "bijection": 334, "injectivity": 335, "from": 336, "surjectivity": 337, "exhibited": 338, "construction": 339, "involving": 340, "isogenous": 341, "often": 342, "referred": 343, "structure": 344, "isogenou": 345, "both": 346, "rational": 347, "maps": 348, "through": 349, "base": 350, "change": 351, "fibrations": 352, "equations": 353, "were": 354, "subsequently": 355, "results": 356, "improved": 357, "derive": 358, "associated": 359, "def": 360, "function": 361, "equation": 362, "fibration": 363, "set": 364, "shafa": 365, "effective": 366, "consist": 367, "single": 368, "shimada": 369, "fundamental": 370, "words": 371, "torsion": 372, "will": 373, "treated": 374, "gen": 375, "provide": 376, "formulation": 377, "word": 378, "drawback": 379, "relation": 380, "recognise": 381, "know": 382, "101": 383, "discriminants": 384, "weinberger": 385, "wb": 386, "most": 387, "more": 388, "none": 389, "under": 390, "condition": 391, "siegel": 392, "landau": 393, "zeroes": 394, "grh": 395, "so": 396, "far": 397, "lacked": 398, "bounds": 399, "degree": 400, "primitivity": 401, "part": 402, "bound": 403, "zeroe": 404, "shall": 405, "now": 406, "understood": 407, "motive": 408, "compatible": 409, "system": 410, "galois": 411, "representations": 412, "attached": 413, "related": 414, "galoi": 415, "representation": 416, "throughout": 417, "fix": 418, "imaginary": 419, "where": 420, "write": 421, "hence": 422, "livne": 423, "every": 424, "mellin": 425, "transform": 426, "eigenform": 427, "weight": 428, "ribet": 429, "newforms": 430, "essentially": 431, "conductor": 432, "ideal": 433, "integers": 434, "type": 435, "satisfies": 436, "norm": 437, "sum": 438, "ideals": 439, "relatively": 440, "inverse": 441, "defines": 442, "newform": 443, "level": 444, "corresponding": 445, "thus": 446, "fourier": 447, "coefficients": 448, "if": 449, "consists": 450, "satisfied": 451, "holds": 452, "\\\\iff": 453, "\\\\sum": 454, "coefficient": 455, "define": 456, "hold": 457, "integer": 458, "satisfy": 459, "thu": 460, "trivial": 461, "setting": 462, "principal": 463, "choosing": 464, "suitable": 465, "values": 466, "generators": 467, "explicitly": 468, "assume": 469, "splits": 470, "uniquely": 471, "unless": 472, "obtain": 473, "once": 474, "normalisation": 475, "fixed": 476, "generator": 477, "value": 478, "arising": 479, "normalisations": 480, "sign": 481, "choices": 482, "twists": 483, "each": 484, "dirichlet": 485, "twisted": 486, "says": 487, "produces": 488, "resp": 489, "eigenforms": 490, "after": 491, "twisting": 492, "choice": 493, "produce": 494, "say": 495, "twist": 496, "identified": 497, "corresponds": 498, "take": 499, "cubic": 500, "biquadratic": 501, "into": 502, "account": 503, "equivalents": 504, "any": 505, "legendre": 506, "symbol": 507, "squarefree": 508, "or": 509, "reader": 510, "rem": 511, "correspond": 512, "equivalent": 513, "elementary": 514, "use": 515, "further": 516, "unique": 517, "fibre": 518, "work": 519, "hall": 520, "studied": 521, "detail": 522, "shcr": 523, "simple": 524, "weierstrass": 525, "derived": 526, "ss2": 527, "hyperbolic": 528, "plane": 529, "zero": 530, "immediate": 531, "written": 532, "components": 533, "special": 534, "multiplicative": 535, "achieved": 536, "appropriate": 537, "st": 538, "already": 539, "table": 540, "component": 541, "goes": 542, "back": 543, "aec": 544, "very": 545, "concretely": 546, "hulek": 547, "verrill": 548, "hv": 549, "goe": 550, "universal": 551, "0": 552, "hand": 553, "space": 554, "cusp": 555, "dimensional": 556, "order": 557, "point": 558, "employ": 559, "abstract": 560, "approach": 561, "quotient": 562, "translation": 563, "rise": 564, "another": 565, "resolving": 566, "singularities": 567, "configuration": 568, "fibres": 569, "claim": 570, "above": 571, "equivalently": 572, "reducible": 573, "completely": 574, "prove": 575, "meets": 576, "non": 577, "meet": 578, "singularity": 579, "height": 580, "pairing": 581, "shmw": 582, "compute": 583, "directly": 584, "correction": 585, "according": 586, "cyclically": 587, "numbered": 588, "intersects": 589, "differ": 590, "cusps": 591, "cannot": 592, "conjugate": 593, "intersect": 594, "ems": 595, "same": 596, "argument": 597, "applies": 598, "them": 599, "kummer": 600, "alternatively": 601, "could": 602, "argue": 603, "image": 604, "fourth": 605, "roots": 606, "unity": 607, "implies": 608, "\\\\implies": 609, "imply": 610, "root": 611, "abelian": 612, "ab": 613, "situation": 614, "mitani": 615, "sm": 616, "noted": 617, "sh": 618, "error": 619, "consequence": 620, "cohomology": 621, "varieties": 622, "carries": 623, "carry": 624, "variety": 625, "reductions": 626, "good": 627, "morphism": 628, "induces": 629, "embeddings": 630, "isometries": 631, "onto": 632, "almost": 633, "argumentation": 634, "supersingular": 635, "generalised": 636, "remainder": 637, "embedding": 638, "induce": 639, "isometry": 640, "frobenius": 641, "endomorphism": 642, "frob": 643, "raising": 644, "coordinates": 645, "th": 646, "powers": 647, "want": 648, "induced": 649, "action": 650, "etale": 651, "adic": 652, "closure": 653, "reciprocal": 654, "characteristic": 655, "polynomial": 656, "acts": 657, "permutation": 658, "cycles": 659, "precisely": 660, "operates": 661, "relates": 662, "shape": 663, "conjecturally": 664, "smooth": 665, "projective": 666, "predicts": 667, "count": 668, "multiplicities": 669, "asd": 670, "milne": 671, "25": 672, "act": 673, "coordinate": 674, "cycle": 675, "frobeniu": 676, "multiplicity": 677, "operate": 678, "power": 679, "predict": 680, "relate": 681, "dim": 682, "pic": 683, "var": 684, "brauer": 685, "square": 686, "free": 687, "numerical": 688, "coincide": 689, "atc": 690, "simplifies": 691, "simplify": 692, "specialise": 693, "computed": 694, "never": 695, "multiple": 696, "exactly": 697, "proceeds": 698, "three": 699, "steps": 700, "cor": 701, "d": 702, "shapes": 703, "proceed": 704, "step": 705, "achieve": 706, "prop": 707, "assumption": 708, "dividing": 709, "y": 710, "add": 711, "divide": 712, "finitely": 713, "describe": 714, "even": 715, "extra": 716, "care": 717, "cases": 718, "purpose": 719, "cas": 720, "rewrite": 721, "pp": 722, "sends": 723, "tab": 724, "send": 725, "inserting": 726, "neither": 727, "minus": 728, "gg": 729, "g": 730, "occurs": 731, "minu": 732, "occur": 733, "second": 734, "similar": 735, "rules": 736, "sextic": 737, "rule": 738, "rephrase": 739, "either": 740, "find": 741, "search": 742, "simultaneously": 743, "dd": 744, "\\\\forall": 745, "obs": 746, "greatest": 747, "common": 748, "occurring": 749, "need": 750, "least": 751, "priori": 752, "information": 753, "divisibility": 754, "problem": 755, "translates": 756, "translate": 757, "represented": 758, "divisible": 759, "note": 760, "represents": 761, "ones": 762, "represent": 763, "well": 764, "equally": 765, "distributed": 766, "classes": 767, "trivially": 768, "numbers": 769, "odd": 770, "u": 771, "v": 772, "half": 773, "vice": 774, "versa": 775, "again": 776, "easily": 777, "checked": 778, "fixes": 779, "seen": 780, "17": 781, "possibilities": 782, "possibility": 783, "13": 784, "four": 785, "imprimitive": 786, "treat": 787, "separately": 788, "intersection": 789, "\\\\cap": 790, "sandwich": 791, "arises": 792, "admits": 793, "isotrivial": 794, "generic": 795, "third": 796, "acting": 797, "via": 798, "admit": 799, "gal": 800, "rk": 801, "aris": 802, "appearing": 803, "ask": 804, "announced": 805, "true": 806, "additional": 807, "web": 808, "convenience": 809, "include": 810, "list": 811, "models": 812, "becomes": 813, "evident": 814, "reference": 815, "naturally": 816, "may": 817, "found": 818, "noam": 819, "rocky": 820, "ty": 821, "explanations": 822, "become": 823, "explanation": 824, "shown": 825, "named": 826, "suffices": 827, "suffice": 828, "diss": 829, "realise": 830, "extremal": 831, "near": 832, "mp1": 833, "changed": 834, "choose": 835, "sit": 836, "27": 837, "searched": 838, "family": 839, "specialisation": 840, "es": 841, "located": 842, "nor": 843, "considered": 844, "answer": 845, "closely": 846, "precise": 847, "context": 848, "should": 849, "mind": 850, "operation": 851, "notably": 852, "affects": 853, "types": 854, "concerns": 855, "affect": 856, "concern": 857, "previous": 858, "leaves": 859, "distinguishes": 860, "distinguish": 861, "leave": 862, "previou": 863, "isomorphic": 864, "determines": 865, "exception": 866, "endowed": 867, "omit": 868, "analogous": 869, "analogou": 870, "infinitely": 871, "lemmata": 872, "flavor": 873, "ideas": 874, "involved": 875, "full": 876, "treatment": 877, "notation": 878, "idea": 879, "before": 880, "latter": 881, "compositum": 882, "agrees": 883, "agree": 884, "those": 885, "p_2": 886, "still": 887, "6": 888, "upon": 889, "increasing": 890, "factors": 891, "factor": 892, "thanks": 893, "able": 894, "thank": 895, "takes": 896, "new": 897, "inspection": 898, "fully": 899, "ultimately": 900, "conjectures": 901, "ground": 902, "eigenvalues": 903, "alpha_p": 904, "squaring": 905, "eigenvalue": 906, "along": 907, "lines": 908, "complete": 909, "line": 910, "arguments": 911, "except": 912, "tells": 913, "mentioned": 914, "tell": 915, "arise": 916, "bm": 917, "open": 918, "generally": 919, "might": 920, "application": 921, "10": 922, "based": 923, "optimal": 924, "16": 925, "24": 926, "how": 927, "possibly": 928, "descend": 929, "starting": 930, "generality": 931, "extent": 932, "identify": 933, "subgroup": 934, "fails": 935, "measure": 936, "reason": 937, "provides": 938, "major": 939, "improvement": 940, "providing": 941, "restrictions": 942, "fail": 943, "restriction": 944, "without": 945, "loss": 946, "guarantees": 947, "guarantee": 948, "limited": 949, "due": 950, "best": 951, "efficiency": 952, "combined": 953, "cohomological": 954, "5cm": 955, "acknowledgement": 956, "like": 957, "t": 958, "stimulating": 959, "discussions": 960, "funding": 961, "dfg": 962, "research": 963, "grant": 964, "schu": 965, "2266": 966, "gratefully": 967, "acknowledged": 968, "discussion": 969, "thebibliography": 970, "99": 971, "swinnerton": 972, "dyer": 973, "shafarevich": 974, "pencils": 975, "invent": 976, "math": 977, "1973": 978, "249": 979, "266": 980, "pencil": 981, "beukers": 982, "montanus": 983, "calculation": 984, "belyi": 985, "polynomials": 986, "33": 987, "51": 988, "london": 989, "soc": 990, "lecture": 991, "ser": 992, "352": 993, "cambridge": 994, "univ": 995, "press": 996, "2008": 997, "beuker": 998, "montanu": 999, "cox": 1000, "fermat": 1001, "wiley": 1002, "interscience": 1003, "1989": 1004, "maximal": 1005, "talk": 1006, "conference": 1007, "birational": 1008, "automorphisms": 1009, "compact": 1010, "manifold": 1011, "dynamical": 1012, "systems": 1013, "nagoya": 1014, "university": 1015, "aug": 1016, "28": 1017, "2007": 1018, "automorphism": 1019, "shimura": 1020, "computations": 1021, "lect": 1022, "notes": 1023, "comp": 1024, "sci": 1025, "5011": 1026, "ants": 1027, "viii": 1028, "springer": 1029, "196": 1030, "211": 1031, "ant": 1032, "computation": 1033, "http": 1034, "www": 1035, "harvard": 1036, "edu": 1037, "_20si": 1038, "html": 1039, "preprint": 1040, "arxiv": 1041, "0809": 1042, "0830": 1043, "jr": 1044, "diophantine": 1045, "computers": 1046, "proc": 1047, "res": 1048, "council": 1049, "atlas": 1050, "sympos": 1051, "oxford": 1052, "1969": 1053, "academic": 1054, "1971": 1055, "173": 1056, "198": 1057, "atla": 1058, "computer": 1059, "sympo": 1060, "kyoto": 1061, "45": 1062, "2005": 1063, "667": 1064, "681": 1065, "defining": 1066, "notion": 1067, "isogeny": 1068, "proceedings": 1069, "international": 1070, "symposium": 1071, "geometry": 1072, "1977": 1073, "kinokuniya": 1074, "book": 1075, "store": 1076, "tokyo": 1077, "1978": 1078, "495": 1079, "502": 1080, "proceeding": 1081, "liu": 1082, "lorenzini": 1083, "raynaud": 1084, "159": 1085, "673": 1086, "676": 1087, "israel": 1088, "92": 1089, "1995": 1090, "149": 1091, "156": 1092, "ann": 1093, "102": 1094, "1975": 1095, "517": 1096, "533": 1097, "addenda": 1098, "errata": 1099, "available": 1100, "homepage": 1101, "jmilne": 1102, "org": 1103, "miranda": 1104, "persson": 1105, "193": 1106, "1986": 1107, "537": 1108, "558": 1109, "izv": 1110, "akad": 1111, "nauk": 1112, "sssr": 1113, "mat": 1114, "35": 1115, "530": 1116, "572": 1117, "nebentypus": 1118, "serre": 1119, "b": 1120, "zagier": 1121, "eds": 1122, "functions": 1123, "variable": 1124, "bonn": 1125, "1976": 1126, "601": 1127, "52": 1128, "nebentypu": 1129, "arithmetic": 1130, "algebra": 1131, "analysis": 1132, "kazan": 1133, "1994": 1134, "de": 1135, "gruyter": 1136, "1996": 1137, "103": 1138, "108": 1139, "analysi": 1140, "dissertation": 1141, "2006": 1142, "universit": 1143, "hannover": 1144, "mountain": 1145, "journal": 1146, "mathematics": 1147, "37": 1148, "609": 1149, "652": 1150, "mathematic": 1151, "communications": 1152, "physics": 1153, "307": 1154, "321": 1155, "communication": 1156, "physic": 1157, "michigan": 1158, "56": 1159, "513": 1160, "527": 1161, "ramanujan": 1162, "2009": 1163, "187": 1164, "205": 1165, "schweizer": 1166, "uniqueness": 1167, "0712": 1168, "3873": 1169, "top": 1170, "comm": 1171, "pauli": 1172, "55": 1173, "9": 1174, "trans": 1175, "amer": 1176, "361": 1177, "909": 1178, "949": 1179, "tran": 1180, "39": 1181, "1990": 1182, "240": 1183, "ranks": 1184, "43": 1185, "117": 1186, "120": 1187, "acad": 1188, "paris": 1189, "337": 1190, "2003": 1191, "461": 1192, "466": 1193, "vol": 1194, "54": 1195, "87": 1196, "88": 1197, "pari": 1198, "certain": 1199, "japan": 1200, "82": 1201, "137": 1202, "140": 1203, "w": 1204, "baily": 1205, "iwanami": 1206, "shoten": 1207, "119": 1208, "136": 1209, "binary": 1210, "manifolds": 1211, "412": 1212, "1974": 1213, "259": 1214, "287": 1215, "poles": 1216, "zeta": 1217, "arithmetical": 1218, "conf": 1219, "purdue": 1220, "1963": 1221, "93": 1222, "110": 1223, "harper": 1224, "row": 1225, "1965": 1226, "\\\\zeta": 1227, "pole": 1228, "birch": 1229, "dxer": 1230, "analog": 1231, "grothendieck": 1232, "kuiper": 1233, "dix": 1234, "expos": 1235, "sur": 1236, "la": 1237, "cohomologie": 1238, "des": 1239, "schemas": 1240, "189": 1241, "214": 1242, "north": 1243, "holland": 1244, "publ": 1245, "amsterdam": 1246, "1968": 1247, "expo": 1248, "schema": 1249, "inv": 1250, "23": 1251, "179": 1252, "206": 1253, "yui": 1254, "663": 1255, "687": 1256, "exponents": 1257, "groups": 1258, "acta": 1259, "arith": 1260, "22": 1261, "124": 1262, "exponent": 1263, "8cm": 1264, "institute": 1265, "leibniz": 1266, "welfengarten": 1267, "30167": 1268, "germany": 1269, "schuett": 1270, "uni": 1271, "\\q": 1272, "x": 1273, "(": 1274, ")": 1275, "<": 1276, "\\sqrt": 1277, "{": 1278, "}": 1279, "\\ns": 1280, "^": 1281, ",": 1282, "\\z": 1283, "=": 1284, "\\bot": 1285, "\\subset": 1286, ".": 1287, "\\mapsto": 1288, "\\{": 1289, "\\text": 1290, "\\}": 1291, "/": 1292, "\\cong": 1293, "\\stackrel": 1294, ":": 1295, "\\longleftrightarrow": 1296, "positive": 1297, "-": 1298, "definite": 1299, "oriented": 1300, "e'": 1301, "ccccc": 1302, "\\times": 1303, "\\\\": 1304, "\\searrow": 1305, "\\swarrow": 1306, "km": 1307, "\\dasharrow": 1308, "disc": 1309, "\\zeta": 1310, "\\c": 1311, "\\psi": 1312, "\\m": 1313, "\\oo": 1314, "\\infty": 1315, "\\alpha": 1316, "\\;": 1317, "\\forall": 1318, "\\equiv": 1319, "\\mod": 1320, "\\mbox": 1321, "\\mathfrak": 1322, "\\sum": 1323, "+": 1324, "|": 1325, "\\neq": 1326, "\\nmid": 1327, "\\frac": 1328, "\\mid": 1329, "\\p": 1330, "\\bar": 1331, "\\in": 1332, "12": 1333, "\\n": 1334, "\\pm": 1335, "\\chi": 1336, "\\subseteq": 1337, "\\circ": 1338, "\\left": 1339, "\\delta": 1340, "\\cdot": 1341, "\\right": 1342, "\\oplus": 1343, "\\gamma": 1344, "\\pp": 1345, "xy": 1346, "2.": 1347, "\\theta": 1348, "67": 1349, "7.": 1350, "\\mu": 1351, "mw": 1352, "\\rho": 1353, "\\f": 1354, "\\ell": 1355, "*": 1356, "\\acute": 1357, "\\det": 1358, "\\,": 1359, ";": 1360, "nq": 1361, "\\leq": 1362, "br": 1363, "m2": 1364, "ym": 1365, "d'": 1366, "d'y": 1367, "8": 1368, "\\mp": 1369, "gcd": 1370, "dr": 1371, "cr": 1372, "\\geq": 1373, "5": 1374, "11": 1375, "ii": 1376, "\\omega": 1377, "\\hline": 1378, "[": 1379, "]": 1380, "\\ref": 1381, "iii": 1382, "\\cite": 1383, "\\s": 1384, "163": 1385, "\\boldsymbol": 1386, "\\dfrac": 1387, "27.": 1388, "iv": 1389, ">": 1390, "lk": 1391, "\\tau": 1392, "ac": 1393, "\\overline": 1394, "\\setminus": 1395, "kl": 1396, "\\#": 1397, "ny": 1398, "\\sim": 1399, "\\sb": 1400, "\\rm": 1401, "\\mathbb": 1402, "\\label": 1403, "\\otimes": 1404, "1.": 1405, "\\hookrightarrow": 1406, "dp": 1407, "231": 1408, "\\big": 1409, "discr": 1410, "tor": 1411, "mn": 1412, "dy": 1413, "alpha": 1414, "\\\\alpha": 1415, "\\sigma": 1416, "aut": 1417}