{"abstracton": 0, "a4paper": 1, "scrartcl": 2, "headsepline": 3, "scrpage2": 4, "latin1": 5, "inputenc": 6, "amsfonts": 7, "amsmath": 8, "amssymb": 9, "amsthm": 10, "amsfont": 11, "url": 12, "graphicx": 13, "pdftex": 14, "colorlinks": 15, "breaklinks": 16, "linkcolor": 17, "black": 18, "citecolor": 19, "filecolor": 20, "menucolor": 21, "urlcolor": 22, "pdfauthor": 23, "lizhen": 24, "ji": 25, "and": 26, "andreas": 27, "weber": 28, "pdftitle": 29, "plainpages": 30, "false": 31, "pdfpagelabels": 32, "bookmarksnumbered": 33, "true": 34, "hyperref": 35, "andrea": 36, "breaklink": 37, "colorlink": 38, "pdfpagelabel": 39, "plainpage": 40, "scrheadings": 41, "l": 42, "a": 43, "dynamics": 44, "of": 45, "the": 46, "heat": 47, "semigroup": 48, "dynamic": 49, "scrheading": 50, "theorem": 51, "section": 52, "lemma": 53, "proposition": 54, "corollary": 55, "definition": 56, "remark": 57, "example": 58, "m": 59, "e": 60, "h": 61, "n": 62, "q": 63, "r": 64, "z": 65, "c": 66, "k": 67, "i": 68, "re": 69, "im": 70, "id": 71, "rang": 72, "grad": 73, "div": 74, "sym": 75, "spur": 76, "isom": 77, "vol": 78, "supp": 79, "inj": 80, "rank": 81, "dom": 82, "tr": 83, "span": 84, "diam": 85, "\\\\nabla": 86, "ric": 87, "con": 88, "dis": 89, "p": 90, "x": 91, "t": 92, "b": 93, "y": 94, "u": 95, "d": 96, "ad": 97, "gl": 98, "sl": 99, "o": 100, "so": 101, "2": 102, "g": 103, "s": 104, "mor": 105, "j": 106, "y_j": 107, "x_i": 108, "dt": 109, "dvol": 110, "_": 111, "_m": 112, "_x": 113, "ax_0": 114, "rad": 115, "p_": 116, "res": 117, "on": 118, "symmetric": 119, "spaces": 120, "email": 121, "lji": 122, "umich": 123, "edu": 124, "address": 125, "1834": 126, "east": 127, "hall": 128, "ann": 129, "arbor": 130, "mi": 131, "48109": 132, "1043": 133, "usa": 134, "partially": 135, "supported": 136, "by": 137, "nsf": 138, "grant": 139, "dms": 140, "0604878": 141, "department": 142, "mathematics": 143, "university": 144, "michigan": 145, "math": 146, "uni": 147, "karlsruhe": 148, "de": 149, "englerstr": 150, "76128": 151, "germany": 152, "institut": 153, "f": 154, "ur": 155, "algebra": 156, "und": 157, "geometrie": 158, "universit": 159, "at": 160, "th": 161, "mathematic": 162, "space": 163, "document": 164, "abstract": 165, "aim": 166, "this": 167, "paper": 168, "is": 169, "to": 170, "show": 171, "that": 172, "semigroups": 173, "non": 174, "compact": 175, "type": 176, "very": 177, "different": 178, "from": 179, "if": 180, "see": 181, "it": 182, "shown": 183, "certain": 184, "shifts": 185, "have": 186, "chaotic": 187, "behavior": 188, "such": 189, "not": 190, "possible": 191, "in": 192, "cases": 193, "these": 194, "results": 195, "are": 196, "compared": 197, "with": 198, "corresponding": 199, "situation": 200, "for": 201, "euclidean": 202, "where": 203, "\\\\in": 204, "cas": 205, "result": 206, "shift": 207, "thi": 208, "keywords": 209, "spherical": 210, "functions": 211, "fourier": 212, "inversion": 213, "formula": 214, "1mm": 215, "function": 216, "keyword": 217, "introduction": 218, "or": 219, "more": 220, "generally": 221, "we": 222, "prove": 223, "whereas": 224, "any": 225, "case": 226, "due": 227, "geometry": 228, "contrasts": 229, "fact": 230, "do": 231, "contrast": 232, "wherea": 233, "related": 234, "phenomenon": 235, "dependence": 236, "spectrum": 237, "while": 238, "laplace": 239, "operator": 240, "equals": 241, "all": 242, "beltrami": 243, "varies": 244, "actually": 245, "together": 246, "further": 247, "information": 248, "eigenvalues": 249, "will": 250, "be": 251, "used": 252, "proof": 253, "indicated": 254, "above": 255, "\\\\forall": 256, "eigenvalue": 257, "equal": 258, "vary": 259, "first": 260, "systematic": 261, "study": 262, "started": 263, "mr1468101": 264, "desch": 265, "schappacher": 266, "webb": 267, "1997": 268, "after": 269, "some": 270, "papers": 271, "treating": 272, "discrete": 273, "appeared": 274, "cf": 275, "mr884467": 276, "mr1111569": 277, "could": 278, "found": 279, "mr2150930": 280, "mr2128736": 281, "mr1855839": 282, "mr2020387": 283, "mr1685272": 284, "mr1484673": 285, "want": 286, "mention": 287, "particular": 288, "herzog": 289, "one": 290, "delaubenfels": 291, "emamirad": 292, "grosse": 293, "erdmann": 294, "studied": 295, "context": 296, "delaubenfel": 297, "however": 298, "seems": 299, "theory": 300, "dynamical": 301, "systems": 302, "sense": 303, "devaney": 304, "as": 305, "has": 306, "been": 307, "applied": 308, "geometric": 309, "settings": 310, "up": 311, "now": 312, "seem": 313, "setting": 314, "system": 315, "our": 316, "main": 317, "input": 318, "cited": 319, "two": 320, "contained": 321, "which": 322, "yield": 323, "sufficient": 324, "condition": 325, "important": 326, "tools": 327, "realm": 328, "needed": 329, "transform": 330, "tool": 331, "similar": 332, "locally": 333, "finite": 334, "volume": 335, "jiweb": 336, "nr": 337, "preliminaries": 338, "preliminary": 339, "denotes": 340, "an": 341, "arbitrary": 342, "complete": 343, "riemannian": 344, "manifold": 345, "domain": 346, "set": 347, "infinitely": 348, "differentiable": 349, "support": 350, "essentially": 351, "self": 352, "adjoint": 353, "hence": 354, "its": 355, "closure": 356, "hilbert": 357, "since": 358, "positive": 359, "generates": 360, "bounded": 361, "analytic": 362, "can": 363, "defined": 364, "spectral": 365, "unbounded": 366, "operators": 367, "submarkovian": 368, "contraction": 369, "therefore": 370, "following": 371, "itemize": 372, "1": 373, "leaves": 374, "invariant": 375, "may": 376, "extended": 377, "strongly": 378, "continuous": 379, "consistent": 380, "furthermore": 381, "angle": 382, "analyticity": 383, "refer": 384, "4": 385, "mr1103113": 386, "mr1224619": 387, "general": 388, "needs": 389, "sector": 390, "mr924464": 391, "mr1023321": 392, "continuou": 393, "denote": 394, "generate": 395, "leave": 396, "need": 397, "generator": 398, "write": 399, "because": 400, "identify": 401, "usual": 402, "dual": 403, "always": 404, "alway": 405, "there": 406, "many": 407, "definitions": 408, "chaos": 409, "use": 410, "basically": 411, "adaption": 412, "mr1046376": 413, "chao": 414, "banach": 415, "called": 416, "conditions": 417, "hold": 418, "exists": 419, "orbit": 420, "dense": 421, "then": 422, "hypercyclic": 423, "ii": 424, "periodic": 425, "points": 426, "\\\\exists": 427, "exist": 428, "point": 429, "remark1": 430, "also": 431, "necessarily": 432, "separable": 433, "again": 434, "subset": 435, "3": 436, "equivalent": 437, "topological": 438, "transitivity": 439, "means": 440, "pair": 441, "empty": 442, "open": 443, "subsets": 444, "both": 445, "orbits": 446, "necessary": 447, "detailed": 448, "mr2142183": 449, "mr2203889": 450, "mr2152389": 451, "mr2280828": 452, "mr2231625": 453, "mr2358980": 454, "5": 455, "only": 456, "infinite": 457, "dimensional": 458, "when": 459, "looking": 460, "jordan": 461, "canonical": 462, "form": 463, "real": 464, "complex": 465, "straightforward": 466, "11": 467, "other": 468, "hand": 469, "every": 470, "mr1974641": 471, "6": 472, "was": 473, "required": 474, "depend": 475, "sensitively": 476, "initial": 477, "property": 478, "redundant": 479, "mr1157223": 480, "7": 481, "concerning": 482, "mr2079359": 483, "mr1710637": 484, "mr2041336": 485, "\\\\subset": 486, "mean": 487, "terms": 488, "properties": 489, "given": 490, "term": 491, "thm": 492, "dsw": 493, "let": 494, "assume": 495, "connected": 496, "iii": 497, "mapping": 498, "already": 499, "holds": 500, "elements": 501, "zero": 502, "but": 503, "remarked": 504, "assumption": 505, "element": 506, "order": 507, "make": 508, "comprehensive": 509, "include": 510, "idea": 511, "major": 512, "role": 513, "played": 514, "observation": 515, "contains": 516, "accumulation": 517, "follows": 518, "indeed": 519, "suppose": 520, "contrary": 521, "hahn": 522, "identity": 523, "contradiction": 524, "sets": 525, "contain": 526, "follow": 527, "highly": 528, "unwanted": 529, "their": 530, "difficult": 531, "much": 532, "appreciated": 533, "subspace": 534, "notion": 535, "introduced": 536, "closed": 537, "restriction": 538, "banasiak": 539, "moszy": 540, "nski": 541, "showed": 542, "criterion": 543, "ban": 544, "note": 545, "here": 546, "either": 547, "eigenvector": 548, "explained": 549, "really": 550, "weaker": 551, "ingredients": 552, "ingredient": 553, "semi": 554, "simple": 555, "lie": 556, "group": 557, "trivial": 558, "center": 559, "acts": 560, "transitively": 561, "maximal": 562, "subgroup": 563, "respective": 564, "algebras": 565, "cartan": 566, "involution": 567, "obtain": 568, "decomposition": 569, "into": 570, "eigenspaces": 571, "identified": 572, "tangent": 573, "metric": 574, "coincides": 575, "killing": 576, "act": 577, "coincide": 578, "eigenspace": 579, "abelian": 580, "restricted": 581, "roots": 582, "subspaces": 583, "root": 584, "once": 585, "weyl": 586, "chamber": 587, "chosen": 588, "half": 589, "sum": 590, "counted": 591, "according": 592, "multiplicity": 593, "\\\\sum": 594, "isometries": 595, "under": 596, "action": 597, "invariance": 598, "kernel": 599, "laplacian": 600, "chapter": 601, "mr1721989": 602, "instead": 603, "isometry": 604, "define": 605, "class": 606, "recall": 607, "iwasawa": 608, "nilpotent": 609, "precisely": 610, "each": 611, "unique": 612, "uniqueness": 613, "well": 614, "prop": 615, "convex": 616, "hull": 617, "mr754767": 618, "mr1016445": 619, "mr954385": 620, "taylor": 621, "observed": 622, "conclude": 623, "eigenfunction": 624, "9": 625, "mr705991": 626, "put": 627, "interior": 628, "parabolic": 629, "region": 630, "proved": 631, "later": 632, "map": 633, "8": 634, "treated": 635, "stanton": 636, "tomas": 637, "harish": 638, "chandra": 639, "toma": 640, "mr518528": 641, "stantom": 642, "lebesgue": 643, "said": 644, "geodesic": 645, "ball": 646, "radius": 647, "co": 648, "measure": 649, "radiu": 650, "part": 651, "check": 652, "identification": 653, "what": 654, "vice": 655, "versa": 656, "seen": 657, "eigenfunctions": 658, "apex": 659, "intersects": 660, "imaginary": 661, "axis": 662, "us": 663, "remains": 664, "satisfying": 665, "branch": 666, "square": 667, "choice": 668, "construction": 669, "plancherel": 670, "axi": 671, "intersect": 672, "remain": 673, "maps": 674, "analytically": 675, "onto": 676, "strip": 677, "satisfies": 678, "claim": 679, "satisfy": 680, "selfadjoint": 681, "intersection": 682, "erratum": 683, "\\\\cap": 684, "proceed": 685, "would": 686, "higher": 687, "most": 688, "parts": 689, "valid": 690, "replace": 691, "choose": 692, "mapped": 693, "assumptions": 694, "thus": 695, "thu": 696, "impossible": 697, "reasons": 698, "neighborhood": 699, "able": 700, "apply": 701, "method": 702, "cannot": 703, "immediately": 704, "reason": 705, "know": 706, "product": 707, "least": 708, "\\\\prod": 709, "products": 710, "restrict": 711, "ourselves": 712, "factors": 713, "changes": 714, "below": 715, "obvious": 716, "yq": 717, "tensor": 718, "algebraic": 719, "uniform": 720, "crossnorm": 721, "vector": 722, "2008ve": 723, "completion": 724, "normed": 725, "exactly": 726, "observing": 727, "isometric": 728, "image": 729, "arguments": 730, "mr0348538": 731, "even": 732, "recurrent": 733, "argument": 734, "change": 735, "factor": 736, "obviou": 737, "ourselve": 738, "implies": 739, "no": 740, "clearly": 741, "\\\\implies": 742, "imply": 743, "comparison": 744, "globally": 745, "mr514561": 746, "occur": 747, "situations": 748, "whose": 749, "allowed": 750, "mr1250269": 751, "acknowledgement": 752, "thank": 753, "referee": 754, "who": 755, "made": 756, "valuable": 757, "comments": 758, "greatly": 759, "improved": 760, "exposition": 761, "comment": 762, "amsplain": 763, "dissertation": 764, "symmetricspaces": 765, "symmetricspace": 766, "^": 767, ">": 768, "<": 769, "\\leq": 770, "\\r": 771, "[": 772, "0": 773, ",": 774, "\\infty": 775, ")": 776, "\\in": 777, "\\boldsymbol": 778, "{": 779, "}": 780, "\\dm": 781, ":": 782, "=": 783, "-": 784, "\\dive": 785, "(": 786, "\\grad": 787, "\\delta": 788, "\\e": 789, "\\geq": 790, "\\cap": 791, "\\subset": 792, "|": 793, "]": 794, "\\theta": 795, "\\frac": 796, "\\pi": 797, "\\arctan": 798, "\\sqrt": 799, "\\dmp": 800, "\\sigma": 801, "p'": 802, "+": 803, "\\{": 804, "\\}": 805, "\\cal": 806, "\\exists": 807, "\\mbox": 808, "\\q": 809, "v": 810, "\\neq": 811, "\\emptyset": 812, "\\left": 813, "\\to": 814, "\\,": 815, "\\right": 816, "\\forall": 817, "\\varepsilon": 818, "\\omega": 819, "pt": 820, "\\lambda": 821, "\\ker": 822, "\\phi": 823, "b'": 824, "\\c": 825, "\\mapsto": 826, "\\circ": 827, "\\spa": 828, "\\re": 829, "per": 830, "\\overline": 831, "\\isom": 832, "/": 833, "\\mathfrak": 834, "\\oplus": 835, "ek": 836, "\\langle": 837, "\\cdot": 838, "\\rangle": 839, "\\cong": 840, "\\tr": 841, "\\ad": 842, "\\alpha": 843, "*": 844, "\\setminus": 845, ".": 846, "\\rho": 847, "\\sum": 848, "\\dim": 849, "\\lpsx": 850, "\\dxp": 851, "\\dom": 852, "\\dxps": 853, "nak": 854, "\\exp": 855, "\\varphi": 856, "gk": 857, "\\int": 858, "kg": 859, "dk": 860, "\\qquad": 861, "w": 862, "dx": 863, "\\lim": 864, "dy": 865, "\\edxps": 866, "\\#": 867, "\\quad": 868, "\\mu": 869, "\\im": 870, "\\hspace": 871, "ex": 872, "\\ldots": 873, "\\times": 874, "\\cdots": 875, "\\otimes": 876, "\\tilde": 877, "rl": 878, "\\iota": 879, "\\vspace": 880, "mm": 881, "\\\\": 882, "\\n": 883, "\\arg": 884, "\\cup": 885}