{"abstracton": 0, "a4paper": 1, "scrartcl": 2, "headsepline": 3, "scrpage2": 4, "latin1": 5, "inputenc": 6, "amsfonts": 7, "amsmath": 8, "amssymb": 9, "amsthm": 10, "amsfont": 11, "wasysym": 12, "url": 13, "graphicx": 14, "pdftex": 15, "colorlinks": 16, "breaklinks": 17, "linkcolor": 18, "black": 19, "citecolor": 20, "filecolor": 21, "menucolor": 22, "urlcolor": 23, "pdfauthor": 24, "andreas": 25, "weber": 26, "pdftitle": 27, "analysis": 28, "of": 29, "the": 30, "physical": 31, "laplacian": 32, "on": 33, "a": 34, "locally": 35, "finite": 36, "graph": 37, "plainpages": 38, "false": 39, "pdfpagelabels": 40, "bookmarksnumbered": 41, "true": 42, "hyperref": 43, "analysi": 44, "andrea": 45, "breaklink": 46, "colorlink": 47, "pdfpagelabel": 48, "plainpage": 49, "scrheadings": 50, "and": 51, "heat": 52, "flow": 53, "scrheading": 54, "theorem": 55, "section": 56, "lemma": 57, "proposition": 58, "corollary": 59, "definition": 60, "remark": 61, "example": 62, "u": 63, "eur": 64, "m": 65, "n": 66, "e": 67, "h": 68, "q": 69, "r": 70, "z": 71, "c": 72, "k": 73, "i": 74, "re": 75, "im": 76, "id": 77, "rang": 78, "grad": 79, "div": 80, "sym": 81, "spur": 82, "isom": 83, "vol": 84, "supp": 85, "inj": 86, "rank": 87, "dom": 88, "tr": 89, "span": 90, "diam": 91, "\\\\nabla": 92, "ric": 93, "con": 94, "dis": 95, "p": 96, "x": 97, "t": 98, "b": 99, "y": 100, "d": 101, "ad": 102, "gl": 103, "sl": 104, "o": 105, "so": 106, "2": 107, "g": 108, "l": 109, "s": 110, "mor": 111, "j": 112, "y_j": 113, "x_i": 114, "dt": 115, "dvol": 116, "_": 117, "_m": 118, "_x": 119, "ax_0": 120, "rad": 121, "res": 122, "mail": 123, "andreasweber": 124, "gmail": 125, "com": 126, "address": 127, "institut": 128, "f": 129, "ur": 130, "algebra": 131, "und": 132, "geometrie": 133, "universit": 134, "at": 135, "karlsruhe": 136, "th": 137, "englerstr": 138, "76128": 139, "germany": 140, "document": 141, "abstract": 142, "we": 143, "study": 144, "corresponding": 145, "an": 146, "infinite": 147, "with": 148, "possibly": 149, "unbounded": 150, "valence": 151, "keywords": 152, "essential": 153, "self": 154, "adjointness": 155, "maximum": 156, "principle": 157, "stochastic": 158, "completeness": 159, "hence": 160, "is": 161, "but": 162, "proof": 163, "keyword": 164, "co": 165, "boundary": 166, "operator": 167, "positivity": 168, "for": 169, "set": 170, "oriented": 171, "edges": 172, "define": 173, "together": 174, "inner": 175, "product": 176, "hilbert": 177, "space": 178, "\\\\prod": 179, "edge": 180, "mr1421568": 181, "map": 182, "called": 183, "cf": 184, "also": 185, "1": 186, "8": 187, "mr743744": 188, "positive": 189, "all": 190, "have": 191, "any": 192, "denote": 193, "by": 194, "resp": 195, "initial": 196, "terminal": 197, "vertex": 198, "then": 199, "straightforward": 200, "calculation": 201, "now": 202, "shows": 203, "result": 204, "follows": 205, "\\\\forall": 206, "follow": 207, "show": 208, "equation": 209, "in": 210, "this": 211, "say": 212, "that": 213, "function": 214, "fundamental": 215, "solution": 216, "if": 217, "bounded": 218, "condition": 219, "differentiable": 220, "satisfies": 221, "holds": 222, "kernel": 223, "below": 224, "construct": 225, "using": 226, "idea": 227, "similar": 228, "to": 229, "one": 230, "setting": 231, "riemannian": 232, "manifolds": 233, "mr711862": 234, "such": 235, "construction": 236, "was": 237, "independently": 238, "developed": 239, "radoslaw": 240, "wojciechowski": 241, "phd": 242, "thesis": 243, "2007": 244, "\\\\in": 245, "hold": 246, "manifold": 247, "satisfy": 248, "thesi": 249, "thi": 250, "principles": 251, "subset": 252, "interior": 253, "let": 254, "be": 255, "furthermore": 256, "assume": 257, "respect": 258, "first": 259, "component": 260, "inequality": 261, "attains": 262, "its": 263, "parabolic": 264, "step": 265, "strict": 266, "point": 267, "it": 268, "contradicts": 269, "\\\\subset": 270, "attain": 271, "contradict": 272, "general": 273, "case": 274, "consider": 275, "our": 276, "obtain": 277, "connected": 278, "can": 279, "more": 280, "as": 281, "difference": 282, "always": 283, "non": 284, "negative": 285, "may": 286, "conclude": 287, "since": 288, "claim": 289, "alway": 290, "special": 291, "preceding": 292, "following": 293, "3": 294, "constant": 295, "domains": 296, "domain": 297, "subsection": 298, "denotes": 299, "dirichlet": 300, "problem": 301, "dp": 302, "where": 303, "canonical": 304, "embedding": 305, "orthogonal": 306, "projection": 307, "onto": 308, "subspace": 309, "adjoint": 310, "there": 311, "are": 312, "finitely": 313, "many": 314, "eigenvalues": 315, "orthonormal": 316, "basis": 317, "consisting": 318, "real": 319, "eigenfunctions": 320, "basi": 321, "eigenfunction": 322, "eigenvalue": 323, "no": 324, "trivial": 325, "harmonic": 326, "functions": 327, "particular": 328, "immediately": 329, "from": 330, "conditions": 331, "given": 332, "facts": 333, "fact": 334, "itemize": 335, "immediate": 336, "consequences": 337, "continuity": 338, "semigroup": 339, "limit": 340, "understood": 341, "sense": 342, "norms": 343, "equivalent": 344, "pointwise": 345, "convergence": 346, "consequence": 347, "norm": 348, "sequence": 349, "subsets": 350, "exists": 351, "constructed": 352, "metric": 353, "balls": 354, "center": 355, "radius": 356, "connectedness": 357, "implies": 358, "union": 359, "these": 360, "equals": 361, "\\\\cup": 362, "\\\\exists": 363, "\\\\implies": 364, "ball": 365, "equal": 366, "exist": 367, "imply": 368, "radiu": 369, "will": 370, "write": 371, "defining": 372, "zero": 373, "either": 374, "or": 375, "not": 376, "contained": 377, "monotonicity": 378, "kernels": 379, "could": 380, "far": 381, "properties": 382, "property": 383, "aim": 384, "prove": 385, "solutions": 386, "decreasing": 387, "ii": 388, "some": 389, "neither": 390, "depends": 391, "nor": 392, "uniform": 393, "compact": 394, "depend": 395, "finiteness": 396, "second": 397, "assumption": 398, "dini": 399, "converges": 400, "uniformly": 401, "therefore": 402, "continuous": 403, "continuou": 404, "converge": 405, "does": 406, "choice": 407, "exhaustion": 408, "doe": 409, "independence": 410, "precisely": 411, "split": 412, "into": 413, "part": 414, "assumptions": 415, "everywhere": 416, "because": 417, "note": 418, "only": 419, "remains": 420, "remain": 421, "last": 422, "sum": 423, "would": 424, "\\\\sum": 425, "turns": 426, "out": 427, "above": 428, "turn": 429, "need": 430, "two": 431, "lemmas": 432, "contraction": 433, "each": 434, "w": 435, "choose": 436, "large": 437, "enough": 438, "remember": 439, "fatou": 440, "yields": 441, "yield": 442, "commuting": 443, "see": 444, "formula": 445, "applies": 446, "apply": 447, "too": 448, "going": 449, "interchange": 450, "summation": 451, "integration": 452, "justified": 453, "tonelli": 454, "contractions": 455, "iterated": 456, "integrals": 457, "integral": 458, "uniqueness": 459, "cauchy": 460, "cp": 461, "admits": 462, "natural": 463, "defined": 464, "number": 465, "vertices": 466, "connect": 467, "smallest": 468, "admit": 469, "vertice": 470, "unique": 471, "uniquely": 472, "determined": 473, "which": 474, "letting": 475, "repeating": 476, "arguments": 477, "considering": 478, "differences": 479, "same": 480, "argument": 481, "satisfied": 482, "found": 483, "mr2246774": 484, "however": 485, "graphs": 486, "fulfilled": 487, "figure": 488, "htb": 489, "laplacianongraphs": 490, "fig1": 491, "pdf": 492, "laplacianongraph": 493, "row": 494, "both": 495, "consists": 496, "exactly": 497, "obviously": 498, "consist": 499, "smooth": 500, "complete": 501, "proved": 502, "ricci": 503, "curvature": 504, "mr505904": 505, "other": 506, "hand": 507, "lower": 508, "bound": 509, "form": 510, "mr1333601": 511, "interpreted": 512, "weak": 513, "stochastically": 514, "every": 515, "claims": 516, "reason": 517, "consequently": 518, "used": 519, "well": 520, "known": 521, "results": 522, "rearrangement": 523, "absolutely": 524, "convergent": 525, "series": 526, "sery": 527, "should": 528, "mentioned": 529, "equivalence": 530, "he": 531, "showed": 532, "yq2008": 533, "able": 534, "provide": 535, "examples": 536, "do": 537, "4": 538, "discussion": 539, "\\\\iff": 540, "acknowledgements": 541, "am": 542, "deeply": 543, "indebted": 544, "daniel": 545, "lenz": 546, "who": 547, "carefully": 548, "read": 549, "whole": 550, "manuscript": 551, "made": 552, "very": 553, "useful": 554, "comments": 555, "suggestions": 556, "want": 557, "thank": 558, "norbert": 559, "peyerimhoff": 560, "his": 561, "interest": 562, "work": 563, "helpful": 564, "remarks": 565, "unusually": 566, "careful": 567, "review": 568, "paper": 569, "greatly": 570, "acknowledged": 571, "acknowledgement": 572, "comment": 573, "suggestion": 574, "amsplain": 575, "dissertation": 576, "graphtheory": 577, "mm": 578, "]": 579, "{": 580, "\\em": 581, "msc": 582, "2000": 583, ":": 584, "}": 585, "05": 586, "c50": 587, ",": 588, "47": 589, "b39": 590, ".": 591, "\\section": 592, "introduction": 593, "preliminaries": 594, "=": 595, "(": 596, "v": 597, ")": 598, "contrast": 599, "normalized": 600, "sometimes": 601, "combinatorial": 602, "\\ell": 603, "^": 604, "complicated": 605, "while": 606, "has": 607, "been": 608, "studied": 609, "extensively": 610, "past": 611, "\\cite": 612, "0645.05048": 613, "references": 614, "therein": 615, "investigations": 616, "concerning": 617, "physically": 618, "motivated": 619, "started": 620, "just": 621, "recently": 622, "mr2257129": 623, "keller": 624, "2008": 625, "nr": 626, "mr2199204": 627, "-": 628, "pointed": 629, "spectral": 630, "laplacians": 631, "might": 632, "different": 633, "tessellating": 634, "planar": 635, "rt": 636, "yq": 637, "next": 638, "\\delta": 639, "appropriate": 640, "essentially": 641, "\\ref": 642, "analogue": 643, "initially": 644, "support": 645, "extends": 646, "mr0062490": 647, "\\pddt": 648, "+": 649, "0": 650, "question": 651, "\\to": 652, "\\r": 653, "give": 654, "ensures": 655, "generalizes": 656, "dodziuk": 657, "mr2218014": 658, "\\\\": 659, "after": 660, "finished": 661, "learned": 662, "about": 663, "recent": 664, "contains": 665, "related": 666, "essentail": 667, "palle": 668, "jorgensen": 669, "sf": 670, "preprint": 671, "yg": 672, "erin": 673, "pearse": 674, "rm": 675, "matthias": 676, "extended": 677, "context": 678, "regular": 679, "forms": 680, "discrete": 681, "sets": 682, "topics": 683, "random": 684, "walks": 685, "networks": 686, "refer": 687, "lyons": 688, "eu": 689, "mr1324344": 690, "mr1743100": 691, "countable": 692, "counting": 693, "measure": 694, "\\#": 695, "\\{": 696, "\\in": 697, "\\sim": 698, "\\}": 699, "\\c": 700, "|": 701, "\\sum": 702, "<": 703, "\\infty": 704, "\\langle": 705, "\\rangle": 706, "\\overline": 707, "complex": 708, "square": 709, "summable": 710, "[": 711, "\\,": 712, "basically": 713, "represented": 714, "use": 715, "notation": 716, "linear": 717, "\\big": 718, "\\frac": 719, "easily": 720, "seen": 721, "\\subset": 722, "dense": 723, "\\d": 724, "make": 725, "proofs": 726, "readable": 727, "\\mapsto": 728, "\\label": 729, "symmetric": 730, "mr0493419": 731, "\\ker": 732, "*": 733, "\\pm": 734, "\\dom": 735, "left": 736, "side": 737, "coincides": 738, "\\textup": 739, "subharmonic": 740, "1.6": 741, "max": 742, "princ": 743, "\\leq": 744, "\\max": 745, "induction": 746, "mf": 747, "/": 748, "0.": 749, "const": 750, "works": 751, "extension": 752, "\\bar": 753, "contrasts": 754, "adjacency": 755, "matrix": 756, "af": 757, "\\\"": 758, "uller": 759, "mr898555": 760, "\\n": 761, "deficiency": 762, "index": 763, "golenia": 764, "lq": 765, "gol": 766, "\\'": 767, "enia": 768, "topic": 769, "discussed": 770, "further": 771, "operators": 772, "\\sup": 773, "triangle": 774, "schwarz": 775, "leads": 776, "\\linebreak": 777, "\\neq": 778, "clearly": 779, "\\[": 780, "\\left": 781, "ll": 782, "\\mbox": 783, "else": 784, "\\right": 785, "coincide": 786, "contain": 787, "ensure": 788, "extend": 789, "generaliz": 790, "investigation": 791, "lead": 792, "lyon": 793, "matthia": 794, "network": 795, "preliminary": 796, "reference": 797, "sometime": 798, "walk": 799, "\\phi": 800, "\\psi": 801, "df": 802, "dg": 803, "\\times": 804, "\\qquad": 805, ">": 806, "\\lim": 807, "\\mathring": 808, "\\rightarrow": 809, "\\partial": 810, "\\setminus": 811, "\\cup": 812, "\\geq": 813, "\\varepsilon": 814, "\\cdot": 815, "lclr": 816, "\\pi": 817, "\\circ": 818, "\\iota": 819, "\\dim": 820, "\\lambda": 821, "\\dots": 822, "\\ldots": 823, "\\e": 824, "\\bigcup": 825, "\\supp": 826, "\\longrightarrow": 827, "\\quad": 828, "tu": 829, "rcl": 830, "ct": 831, "2.": 832, "\\kappa": 833, "\\coth": 834, "k'": 835, "\\int": 836, "\\tau": 837}