{"abstracton": 0, "a4paper": 1, "scrartcl": 2, "headsepline": 3, "scrpage2": 4, "latin1": 5, "inputenc": 6, "amsfonts": 7, "amsmath": 8, "amssymb": 9, "amsthm": 10, "amsfont": 11, "url": 12, "graphicx": 13, "pdftex": 14, "colorlinks": 15, "breaklinks": 16, "linkcolor": 17, "black": 18, "citecolor": 19, "filecolor": 20, "menucolor": 21, "urlcolor": 22, "pdfauthor": 23, "lizhen": 24, "ji": 25, "and": 26, "andreas": 27, "weber": 28, "pdftitle": 29, "lp": 30, "spectral": 31, "theory": 32, "heat": 33, "dynamics": 34, "of": 35, "locally": 36, "symmetric": 37, "spaces": 38, "plainpages": 39, "false": 40, "pdfpagelabels": 41, "bookmarksnumbered": 42, "true": 43, "hyperref": 44, "andrea": 45, "breaklink": 46, "colorlink": 47, "dynamic": 48, "pdfpagelabel": 49, "plainpage": 50, "space": 51, "scrheadings": 52, "l": 53, "a": 54, "scrheading": 55, "theorem": 56, "section": 57, "lemma": 58, "proposition": 59, "corollary": 60, "definition": 61, "remark": 62, "example": 63, "m": 64, "e": 65, "h": 66, "n": 67, "q": 68, "r": 69, "z": 70, "c": 71, "k": 72, "i": 73, "re": 74, "im": 75, "id": 76, "rang": 77, "grad": 78, "div": 79, "sym": 80, "spur": 81, "isom": 82, "vol": 83, "supp": 84, "inj": 85, "rank": 86, "dom": 87, "tr": 88, "span": 89, "diam": 90, "\\\\nabla": 91, "ric": 92, "con": 93, "dis": 94, "p": 95, "x": 96, "t": 97, "b": 98, "y": 99, "u": 100, "d": 101, "ad": 102, "gl": 103, "sl": 104, "o": 105, "so": 106, "2": 107, "g": 108, "s": 109, "mor": 110, "j": 111, "y_j": 112, "x_i": 113, "dt": 114, "dvol": 115, "_": 116, "_m": 117, "_x": 118, "ax_0": 119, "rad": 120, "p_": 121, "res": 122, "email": 123, "lji": 124, "umich": 125, "edu": 126, "address": 127, "1834": 128, "east": 129, "hall": 130, "ann": 131, "arbor": 132, "mi": 133, "48109": 134, "1043": 135, "usa": 136, "partially": 137, "supported": 138, "by": 139, "nsf": 140, "grant": 141, "dms": 142, "0604878": 143, "department": 144, "mathematics": 145, "university": 146, "michigan": 147, "math": 148, "uni": 149, "karlsruhe": 150, "de": 151, "englerstr": 152, "76128": 153, "germany": 154, "institut": 155, "f": 156, "ur": 157, "algebra": 158, "und": 159, "geometrie": 160, "universit": 161, "at": 162, "th": 163, "mathematic": 164, "document": 165, "abstract": 166, "in": 167, "this": 168, "paper": 169, "we": 170, "first": 171, "derive": 172, "several": 173, "results": 174, "concerning": 175, "the": 176, "spectrum": 177, "with": 178, "one": 179, "particular": 180, "show": 181, "that": 182, "there": 183, "is": 184, "an": 185, "open": 186, "subset": 187, "consisting": 188, "eigenvalues": 189, "laplacian": 190, "if": 191, "corresponding": 192, "eigenfunctions": 193, "are": 194, "given": 195, "certain": 196, "eisenstein": 197, "series": 198, "on": 199, "other": 200, "hand": 201, "most": 202, "discrete": 203, "set": 204, "real": 205, "these": 206, "used": 207, "second": 208, "part": 209, "order": 210, "to": 211, "semigroups": 212, "for": 213, "very": 214, "different": 215, "from": 216, "\\\\in": 217, "\\\\subset": 218, "eigenfunction": 219, "eigenvalue": 220, "result": 221, "semigroup": 222, "sery": 223, "thi": 224, "keywords": 225, "chaotic": 226, "1mm": 227, "keyword": 228, "introduction": 229, "purpose": 230, "twofold": 231, "concerned": 232, "laplace": 233, "beltrami": 234, "operator": 235, "then": 236, "will": 237, "use": 238, "obtained": 239, "about": 240, "contrast": 241, "as": 242, "only": 243, "known": 244, "special": 245, "situations": 246, "but": 247, "reasons": 248, "study": 249, "also": 250, "firstly": 251, "physical": 252, "point": 253, "view": 254, "natural": 255, "diffusion": 256, "function": 257, "denotes": 258, "distribution": 259, "time": 260, "total": 261, "amount": 262, "some": 263, "region": 264, "norm": 265, "hence": 266, "has": 267, "meaning": 268, "more": 269, "difficult": 270, "handle": 271, "than": 272, "reflexive": 273, "always": 274, "bounded": 275, "analytic": 276, "whereas": 277, "general": 278, "not": 279, "secondly": 280, "already": 281, "many": 282, "differential": 283, "operators": 284, "domains": 285, "euclidean": 286, "various": 287, "aspects": 288, "see": 289, "mr1269649": 290, "mr1103113": 291, "mr1345724": 292, "mr1458713": 293, "mr836002": 294, "mr869525": 295, "mr1602267": 296, "mr1673414": 297, "mr1824257": 298, "mr1224619": 299, "mr1420468": 300, "alway": 301, "aspect": 302, "denote": 303, "domain": 304, "reason": 305, "situation": 306, "variou": 307, "wherea": 308, "another": 309, "mention": 310, "fact": 311, "question": 312, "whether": 313, "riemannian": 314, "manifold": 315, "depends": 316, "non": 317, "trivially": 318, "related": 319, "geometry": 320, "volume": 321, "growth": 322, "respective": 323, "mr1250269": 324, "even": 325, "interested": 326, "case": 327, "it": 328, "could": 329, "be": 330, "worth": 331, "studying": 332, "spectra": 333, "knowledge": 334, "yields": 335, "cases": 336, "further": 337, "information": 338, "decay": 339, "mr937635": 340, "2007fk": 341, "mr1016445": 342, "furthermore": 343, "mr1470419": 344, "wang": 345, "was": 346, "complete": 347, "manifolds": 348, "negative": 349, "ricci": 350, "curvature": 351, "calculate": 352, "he": 353, "calculated": 354, "sturm": 355, "does": 356, "depend": 357, "cas": 358, "doe": 359, "yield": 360, "finally": 361, "new": 362, "phenomena": 363, "cannot": 364, "occur": 365, "compact": 366, "type": 367, "contains": 368, "uncountable": 369, "number": 370, "precisely": 371, "have": 372, "following": 373, "taylor": 374, "contain": 375, "cf": 376, "let": 377, "any": 378, "where": 379, "interior": 380, "parabolic": 381, "spherical": 382, "functions": 383, "no": 384, "refer": 385, "follows": 386, "easily": 387, "using": 388, "helgason": 389, "fourier": 390, "transform": 391, "which": 392, "turns": 393, "into": 394, "multiplication": 395, "follow": 396, "turn": 397, "examined": 398, "articles": 399, "davies": 400, "simon": 401, "determined": 402, "hyperbolic": 403, "geometrically": 404, "finite": 405, "quotients": 406, "lohou": 407, "rychener": 408, "mr689073": 409, "should": 410, "mentioned": 411, "they": 412, "derived": 413, "estimates": 414, "resolvent": 415, "all": 416, "complex": 417, "numbers": 418, "such": 419, "treated": 420, "mr2342629": 421, "precise": 422, "identification": 423, "universal": 424, "covering": 425, "contained": 426, "classical": 427, "mr0367561": 428, "clerc": 429, "stein": 430, "article": 431, "davy": 432, "estimate": 433, "quotient": 434, "aims": 435, "similar": 436, "establish": 437, "generalized": 438, "therefore": 439, "can": 440, "regarded": 441, "analog": 442, "our": 443, "plenty": 444, "actually": 445, "honest": 446, "aim": 447, "here": 448, "compared": 449, "roles": 450, "interchanged": 451, "means": 452, "similarly": 453, "defined": 454, "consists": 455, "besides": 456, "possible": 457, "beside": 458, "consist": 459, "mean": 460, "role": 461, "investigate": 462, "products": 463, "older": 464, "inequality": 465, "extension": 466, "details": 467, "make": 468, "behavior": 469, "contrasts": 470, "become": 471, "larger": 472, "potential": 473, "available": 474, "suddenly": 475, "detail": 476, "product": 477, "greater": 478, "complicated": 479, "hold": 480, "too": 481, "step": 482, "direction": 483, "work": 484, "out": 485, "asymptotic": 486, "automorphic": 487, "form": 488, "infinity": 489, "controlled": 490, "its": 491, "constant": 492, "term": 493, "prop": 494, "main": 495, "proven": 496, "plan": 497, "treat": 498, "higher": 499, "future": 500, "publication": 501, "\\\\infty": 502, "analogous": 503, "been": 504, "nr": 505, "analogou": 506, "preliminaries": 507, "preliminary": 508, "arbitrary": 509, "acting": 510, "differentiable": 511, "support": 512, "essentially": 513, "self": 514, "adjoint": 515, "closure": 516, "hilbert": 517, "since": 518, "positive": 519, "generates": 520, "unbounded": 521, "submarkovian": 522, "contraction": 523, "itemize": 524, "1": 525, "leaves": 526, "invariant": 527, "may": 528, "extended": 529, "strongly": 530, "continuous": 531, "consistent": 532, "sense": 533, "angle": 534, "analyticity": 535, "proof": 536, "4": 537, "needs": 538, "however": 539, "sector": 540, "mr924464": 541, "mr1023321": 542, "continuou": 543, "generate": 544, "leave": 545, "need": 546, "generator": 547, "write": 548, "because": 549, "above": 550, "identify": 551, "usual": 552, "dual": 553, "equals": 554, "family": 555, "restrictions": 556, "intersection": 557, "their": 558, "coincide": 559, "\\\\cap": 560, "equal": 561, "restriction": 562, "banach": 563, "obtain": 564, "consistency": 565, "resp": 566, "conclude": 567, "subsection": 568, "needed": 569, "later": 570, "recall": 571, "uniqueness": 572, "solutions": 573, "equation": 574, "strichartz": 575, "3": 576, "9": 577, "mr705991": 578, "solution": 579, "thm": 580, "each": 581, "constants": 582, "put": 583, "conditions": 584, "obviously": 585, "fulfilled": 586, "note": 587, "completely": 588, "obvious": 589, "satisfies": 590, "eigenequation": 591, "exactly": 592, "do": 593, "know": 594, "restrict": 595, "ourselves": 596, "below": 597, "exist": 598, "7": 599, "mr0356254": 600, "condition": 601, "obviou": 602, "ourselve": 603, "satisfy": 604, "semi": 605, "simple": 606, "lie": 607, "group": 608, "trivial": 609, "center": 610, "acts": 611, "transitively": 612, "maximal": 613, "subgroup": 614, "algebras": 615, "cartan": 616, "involution": 617, "decomposition": 618, "eigenspaces": 619, "subspace": 620, "identified": 621, "tangent": 622, "assume": 623, "metric": 624, "coincides": 625, "killing": 626, "act": 627, "eigenspace": 628, "abelian": 629, "restricted": 630, "roots": 631, "pair": 632, "subspaces": 633, "called": 634, "root": 635, "once": 636, "weyl": 637, "chamber": 638, "chosen": 639, "half": 640, "sum": 641, "counted": 642, "according": 643, "multiplicity": 644, "\\\\sum": 645, "say": 646, "uniform": 647, "lattice": 648, "without": 649, "fixed": 650, "points": 651, "admits": 652, "admit": 653, "boundary": 654, "finitely": 655, "ends": 656, "associated": 657, "cuspidal": 658, "subgroups": 659, "fibered": 660, "cusp": 661, "mr614517": 662, "margulis": 663, "arithmeticity": 664, "arithmetic": 665, "mr1090825": 666, "mr776417": 667, "mr932135": 668, "now": 669, "basic": 670, "facts": 671, "fix": 672, "notation": 673, "found": 674, "mr0232893": 675, "mr1839581": 676, "mr1025165": 677, "mr0267041": 678, "class": 679, "cusps": 680, "basically": 681, "via": 682, "w": 683, "uller": 684, "book": 685, "mr891654": 686, "end": 687, "marguli": 688, "langlands": 689, "reduction": 690, "langland": 691, "unipotent": 692, "dimensional": 693, "reductive": 694, "iii": 695, "11": 696, "mr2189882": 697, "comparison": 698, "rational": 699, "12": 700, "horocyclic": 701, "canonical": 702, "projection": 703, "diffeomorphism": 704, "\\\\prod": 705, "groups": 706, "system": 707, "define": 708, "defines": 709, "ordering": 710, "distinct": 711, "orthogonal": 712, "respect": 713, "systems": 714, "canonically": 715, "isomorphic": 716, "mr0244260": 717, "moreover": 718, "call": 719, "us": 720, "siegel": 721, "sufficiently": 722, "large": 723, "subsets": 724, "l2": 725, "knows": 726, "union": 727, "absolutely": 728, "possibly": 729, "infinite": 730, "sequence": 731, "multiplicities": 732, "what": 733, "spanned": 734, "complement": 735, "\\\\cup": 736, "parametrized": 737, "reference": 738, "measurable": 739, "integrable": 740, "along": 741, "measure": 742, "normalized": 743, "property": 744, "denoted": 745, "\\\\forall": 746, "inclusion": 747, "strict": 748, "zero": 749, "image": 750, "under": 751, "discretely": 752, "converges": 753, "uniformly": 754, "holomorphic": 755, "meromorphically": 756, "continued": 757, "converge": 758, "pole": 759, "coordinates": 760, "formula": 761, "laplacians": 762, "calculation": 763, "8": 764, "mr754767": 765, "or": 766, "15": 767, "mr0231321": 768, "terms": 769, "itself": 770, "absolute": 771, "convergence": 772, "meromorphic": 773, "continuation": 774, "claim": 775, "coordinate": 776, "description": 777, "thus": 778, "empty": 779, "thu": 780, "choose": 781, "orthonormal": 782, "basis": 783, "bases": 784, "unique": 785, "poles": 786, "plane": 787, "interval": 788, "residue": 789, "bas": 790, "basi": 791, "entries": 792, "scattering": 793, "matrix": 794, "entry": 795, "linear": 796, "same": 797, "strictly": 798, "smaller": 799, "representatives": 800, "representative": 801, "concern": 802, "prove": 803, "preceding": 804, "well": 805, "stated": 806, "previous": 807, "shows": 808, "previou": 809, "element": 810, "smooth": 811, "mr0338456": 812, "mr0387496": 813, "integrals": 814, "readily": 815, "seen": 816, "integral": 817, "rapidly": 818, "decreasing": 819, "mr1361168": 820, "13": 821, "6": 822, "mr1482800": 823, "lemmas": 824, "immediately": 825, "statement": 826, "clearly": 827, "when": 828, "correspond": 829, "duality": 830, "closed": 831, "upper": 832, "bound": 833, "equality": 834, "holds": 835, "important": 836, "modular": 837, "varieties": 838, "\\\\iff": 839, "variety": 840, "introduce": 841, "totally": 842, "field": 843, "ring": 844, "integers": 845, "factor": 846, "embedding": 847, "properly": 848, "generally": 849, "index": 850, "often": 851, "integer": 852, "unless": 853, "triangular": 854, "matrices": 855, "exists": 856, "minimal": 857, "whose": 858, "locus": 859, "split": 860, "component": 861, "diagonal": 862, "onto": 863, "implies": 864, "mr1050763": 865, "remarks": 866, "\\\\exists": 867, "\\\\implies": 868, "imply": 869, "locu": 870, "matrice": 871, "definitions": 872, "chaos": 873, "adaption": 874, "devaney": 875, "mr1046376": 876, "setting": 877, "mr1468101": 878, "chao": 879, "two": 880, "orbit": 881, "dense": 882, "ii": 883, "periodic": 884, "remark1": 885, "necessarily": 886, "separable": 887, "again": 888, "equivalent": 889, "topological": 890, "transitivity": 891, "both": 892, "orbits": 893, "necessary": 894, "5": 895, "looking": 896, "jordan": 897, "straightforward": 898, "mr1685272": 899, "sufficient": 900, "properties": 901, "desch": 902, "schappacher": 903, "webb": 904, "dsw": 905, "connected": 906, "mapping": 907, "required": 908, "elements": 909, "remarked": 910, "mr2128736": 911, "assumption": 912, "redundant": 913, "comprehensive": 914, "include": 915, "idea": 916, "major": 917, "played": 918, "observation": 919, "accumulation": 920, "indeed": 921, "suppose": 922, "contrary": 923, "hahn": 924, "identity": 925, "contradiction": 926, "sets": 927, "dynamical": 928, "highly": 929, "unwanted": 930, "much": 931, "appreciated": 932, "banasiak": 933, "moszy": 934, "nski": 935, "showed": 936, "criterion": 937, "ban": 938, "either": 939, "eigenvector": 940, "explained": 941, "really": 942, "weaker": 943, "check": 944, "apex": 945, "intersects": 946, "imaginary": 947, "axis": 948, "branch": 949, "square": 950, "mapped": 951, "analytically": 952, "strip": 953, "map": 954, "composition": 955, "mappings": 956, "\\\\int": 957, "axi": 958, "intersect": 959, "mr1855839": 960, "erratum": 961, "lead": 962, "shown": 963, "tensor": 964, "cross": 965, "2008ve": 966, "completion": 967, "normed": 968, "mr0348538": 969, "accordingly": 970, "yq": 971, "recurrent": 972, "hypercyclic": 973, "acknowledgements": 974, "want": 975, "thank": 976, "referee": 977, "valuable": 978, "comments": 979, "pointing": 980, "acknowledgement": 981, "comment": 982, "amsplain": 983, "dissertation": 984, "symmetricspaces": 985, "symmetricspace": 986, "^": 987, "\\boldsymbol": 988, "{": 989, "}": 990, "\\c": 991, "<": 992, ">": 993, "\\geq": 994, "\\in": 995, "[": 996, ",": 997, "\\infty": 998, ")": 999, "(": 1000, "\\cdot": 1001, "0": 1002, "\\omega": 1003, "|": 1004, "\\sigma": 1005, "\\delta": 1006, "=": 1007, "\\left": 1008, "\\{": 1009, "\\rho": 1010, "-": 1011, ":": 1012, "\\re": 1013, "\\leq": 1014, "\\frac": 1015, "\\right": 1016, "\\}": 1017, ".": 1018, "\\gamma": 1019, "\\backslash": 1020, "\\hy": 1021, "\\dmp": 1022, "\\to": 1023, "\\hookrightarrow": 1024, "\\downarrow": 1025, "\\q": 1026, "\\dive": 1027, "\\grad": 1028, "\\dm": 1029, "\\cap": 1030, "\\subset": 1031, "]": 1032, "\\theta": 1033, "\\pi": 1034, "\\arctan": 1035, "\\sqrt": 1036, "p'": 1037, "+": 1038, "\\qquad": 1039, "\\mbox": 1040, "\\dom": 1041, "\\e": 1042, "\\xrightarrow": 1043, "\\quad": 1044, "\\,": 1045, "v": 1046, "\\times": 1047, "\\r": 1048, "\\pddt": 1049, "\\mu": 1050, "\\isom": 1051, "/": 1052, "\\mathfrak": 1053, "\\oplus": 1054, "ek": 1055, "\\langle": 1056, "\\rangle": 1057, "\\cong": 1058, "\\tr": 1059, "\\ad": 1060, "\\circ": 1061, "\\alpha": 1062, "*": 1063, "\\setminus": 1064, "\\neq": 1065, "\\sum": 1066, "\\dim": 1067, "\\ldots": 1068, "\\rank": 1069, "pa": 1070, "pm": 1071, "\\tau": 1072, "\\phi": 1073, "\\bigoplus": 1074, "\\beta": 1075, "\\lambda": 1076, "\\dots": 1077, "\\int": 1078, "nx": 1079, "dn": 1080, "cus": 1081, "\\varphi": 1082, "\\otimes": 1083, "\\nu": 1084, "dzdy": 1085, "\\log": 1086, "yh": 1087, "\\pm": 1088, "pe": 1089, "dy": 1090, "\\sup": 1091, "\\im": 1092, "\\tilde": 1093, "\\exists": 1094, "\\n": 1095, "\\cup": 1096, "\\\n": 1097, "\\cal": 1098, "\\cdots": 1099, "\\bp": 1100, "\\\\": 1101, "\\emptyset": 1102, "\\forall": 1103, "\\varepsilon": 1104, "pt": 1105, "\\ker": 1106, "b'": 1107, "\\mapsto": 1108, "\\spa": 1109, "per": 1110, "\\overline": 1111, "dx": 1112, "\\big": 1113, "\\arg": 1114, "\\inf": 1115, "\\longrightarrow": 1116, "\\label": 1117, "nam": 1118}