{"reqno": 0, "amsart": 1, "all": 2, "xy": 3, "graphicx": 4, "amssymb": 5, "amsmath": 6, "mathrsfs": 7, "epsfig": 8, "amscd": 9, "color": 10, "mathrsf": 11, "e": 12, "n": 13, "r": 14, "q": 15, "c": 16, "h": 17, "z": 18, "p": 19, "t": 20, "s": 21, "d": 22, "equation": 23, "enumerate": 24, "center": 25, "i": 26, "0": 27, "2cm": 28, "theorem": 29, "thm": 30, "section": 31, "cor": 32, "corollary": 33, "lem": 34, "lemma": 35, "prop": 36, "proposition": 37, "ax": 38, "axiom": 39, "conj": 40, "conjecture": 41, "definition": 42, "defn": 43, "rem": 44, "remark": 45, "ques": 46, "question": 47, "cons": 48, "construction": 49, "exm": 50, "example": 51, "con": 52, "que": 53, "notation": 54, "5": 55, "0truein": 56, "25truein": 57, "8": 58, "375truein": 59, "15truein": 60, "osc": 61, "crit": 62, "tr": 63, "dtr": 64, "o": 65, "11": 66, "x": 67, "y": 68, "u": 69, "j": 70, "x_0": 71, "lim": 72, "v": 73, "a": 74, "l": 75, "m": 76, "f": 77, "b": 78, "g": 79, "k": 80, "w": 81, "1": 82, "_": 83, "2": 84, "5ex": 85, "16": 86, "5mu": 87, "3": 88, "4": 89, "3ex": 90, "75em": 91, "1ex": 92, "0pt": 93, "re": 94, "im": 95, "end": 96, "dim": 97, "vol": 98, "su": 99, "so": 100, "supp": 101, "doub": 102, "dev": 103, "tan": 104, "cal": 105, "leng": 106, "per": 107, "reeb": 108, "aut": 109, "document": 110, "hoch": 111, "embedding": 112, "property": 113, "of": 114, "holomorphic": 115, "curves": 116, "in": 117, "calabi": 118, "yau": 119, "manifolds": 120, "for": 121, "generic": 122, "yong": 123, "geun": 124, "oh": 125, "department": 126, "mathematics": 127, "university": 128, "wisconsin": 129, "madison": 130, "wi": 131, "53706": 132, "korea": 133, "institute": 134, "advanced": 135, "study": 136, "seoul": 137, "math": 138, "wisc": 139, "edu": 140, "the": 141, "senior": 142, "author": 143, "is": 144, "partially": 145, "supported": 146, "by": 147, "nsf": 148, "grant": 149, "dms": 150, "0503954": 151, "\\\\in": 152, "curve": 153, "manifold": 154, "mathematic": 155, "ke": 156, "zhu": 157, "chinese": 158, "hong": 159, "kong": 160, "kzhu": 161, "cuhk": 162, "hk": 163, "abstract": 164, "this": 165, "paper": 166, "we": 167, "prove": 168, "that": 169, "choice": 170, "tame": 171, "or": 172, "compatible": 173, "almost": 174, "complex": 175, "structures": 176, "on": 177, "symplectic": 178, "with": 179, "and": 180, "its": 181, "first": 182, "chern": 183, "class": 184, "somewhere": 185, "injective": 186, "maps": 187, "from": 188, "any": 189, "closed": 190, "smooth": 191, "riemann": 192, "surface": 193, "into": 194, "are": 195, "embedded": 196, "derive": 197, "result": 198, "as": 199, "consequence": 200, "general": 201, "optimal": 202, "jet": 203, "evaluation": 204, "transversality": 205, "also": 206, "map": 207, "structure": 208, "thi": 209, "revision": 210, "jan": 211, "31": 212, "2009": 213, "introduction": 214, "sec": 215, "intro": 216, "let": 217, "be": 218, "real": 219, "dimension": 220, "denote": 221, "an": 222, "to": 223, "set": 224, "it": 225, "classical": 226, "fact": 227, "gromov": 228, "mcduff": 229, "point": 230, "moduli": 231, "space": 232, "called": 233, "if": 234, "there": 235, "such": 236, "has": 237, "been": 238, "fundamental": 239, "witten": 240, "invariants": 241, "counting": 242, "problem": 243, "recent": 244, "development": 245, "theory": 246, "unravels": 247, "necessity": 248, "finer": 249, "image": 250, "particular": 251, "conjectural": 252, "mathematical": 253, "gopakuma": 254, "vafa": 255, "invariant": 256, "bps": 257, "count": 258, "closely": 259, "related": 260, "number": 261, "three": 262, "folds": 263, "konts": 264, "pandh": 265, "fold": 266, "kont": 267, "unravel": 268, "now": 269, "description": 270, "main": 271, "results": 272, "order": 273, "connected": 274, "genus": 275, "call": 276, "pair": 277, "satisfies": 278, "say": 279, "fredholm": 280, "regular": 281, "linearization": 282, "surjective": 283, "at": 284, "have": 285, "index": 286, "formula": 287, "given": 288, "eq": 289, "d_": 290, "_j": 291, "cases": 292, "c_1": 293, "hence": 294, "virtual": 295, "associated": 296, "vdim": 297, "cas": 298, "genu": 299, "satisfy": 300, "following": 301, "assume": 302, "then": 303, "exists": 304, "subset": 305, "second": 306, "category": 307, "whenever": 308, "\\\\exists": 309, "\\\\subset": 310, "exist": 311, "would": 312, "like": 313, "out": 314, "content": 315, "only": 316, "case": 317, "otherwise": 318, "shows": 319, "higher": 320, "cannot": 321, "when": 322, "show": 323, "which": 324, "immediately": 325, "gives": 326, "rise": 327, "establishing": 328, "see": 329, "trans": 330, "upsilon": 331, "argument": 332, "\\\\upsilon": 333, "give": 334, "tran": 335, "immersed": 336, "provided": 337, "another": 338, "immediate": 339, "specialization": 340, "classification": 341, "stable": 342, "threefolds": 343, "threefold": 344, "stablemap": 345, "suppose": 346, "one": 347, "types": 348, "either": 349, "domain": 350, "factors": 351, "through": 352, "composition": 353, "some": 354, "ramified": 355, "covering": 356, "type": 357, "irreducible": 358, "components": 359, "same": 360, "locus": 361, "images": 362, "over": 363, "except": 364, "those": 365, "constant": 366, "latter": 367, "two": 368, "can": 369, "occur": 370, "form": 371, "positive": 372, "integer": 373, "homology": 374, "component": 375, "factor": 376, "locu": 377, "brief": 378, "outline": 379, "establish": 380, "immersion": 381, "half": 382, "most": 383, "novel": 384, "essential": 385, "part": 386, "involves": 387, "consideration": 388, "turn": 389, "forces": 390, "us": 391, "work": 392, "setting": 393, "becomes": 394, "differentiable": 395, "respect": 396, "variation": 397, "points": 398, "taking": 399, "derivatives": 400, "sobolev": 401, "spaces": 402, "however": 403, "actual": 404, "analysis": 405, "involving": 406, "rather": 407, "delicate": 408, "partly": 409, "because": 410, "overcome": 411, "not": 412, "defined": 413, "pointwise": 414, "novelty": 415, "our": 416, "proof": 417, "judicious": 418, "usage": 419, "distributions": 420, "supports": 421, "eta": 422, "\\\\eta": 423, "analysi": 424, "become": 425, "derivative": 426, "distribution": 427, "force": 428, "involve": 429, "judiciou": 430, "support": 431, "scheme": 432, "motivated": 433, "similar": 434, "authors": 435, "sketched": 436, "nodal": 437, "floer": 438, "trajectory": 439, "hutchings": 440, "taubes": 441, "hutch": 442, "concerns": 443, "different": 444, "context": 445, "more": 446, "specifically": 447, "17": 448, "wendl": 449, "their": 450, "proofs": 451, "both": 452, "papers": 453, "utilize": 454, "they": 455, "concern": 456, "low": 457, "dimensional": 458, "comparison": 459, "between": 460, "condition": 461, "corresponds": 462, "while": 463, "correspond": 464, "conceivable": 465, "modifications": 466, "could": 467, "generalized": 468, "did": 469, "check": 470, "hutching": 471, "modification": 472, "taube": 473, "aside": 474, "natural": 475, "framework": 476, "used": 477, "appendix": 478, "own": 479, "merit": 480, "suits": 481, "well": 482, "generalization": 483, "hope": 484, "come": 485, "back": 486, "elsewhere": 487, "suit": 488, "stated": 489, "above": 490, "follows": 491, "follow": 492, "key": 493, "removable": 494, "singularity": 495, "gelfand": 496, "discuss": 497, "implication": 498, "thank": 499, "pandharipande": 500, "his": 501, "interest": 502, "current": 503, "useful": 504, "discussion": 505, "counts": 506, "anonymous": 507, "referee": 508, "pointing": 509, "inaccuracies": 510, "previous": 511, "version": 512, "providing": 513, "suggestions": 514, "improvement": 515, "reference": 516, "anonymou": 517, "inaccuracy": 518, "previou": 519, "suggestion": 520, "subsection": 521, "will": 522, "present": 523, "arguments": 524, "other": 525, "parts": 526, "standard": 527, "known": 528, "pseudo": 529, "provide": 530, "informal": 531, "motivate": 532, "necessary": 533, "up": 534, "precise": 535, "analytical": 536, "consider": 537, "triple": 538, "define": 539, "where": 540, "du": 541, "identify": 542, "target": 543, "bundles": 544, "hom": 545, "j_z": 546, "j_x": 547, "t_z": 548, "t_x": 549, "unions": 550, "taken": 551, "fibers": 552, "anti": 553, "linear": 554, "denoted": 555, "respectively": 556, "usual": 557, "\\\\forall": 558, "bundle": 559, "fiber": 560, "union": 561, "introduce": 562, "needed": 563, "off": 564, "shell": 565, "function": 566, "hosting": 567, "operator": 568, "each": 569, "associate": 570, "vector": 571, "rank": 572, "corresponding": 573, "marked": 574, "does": 575, "play": 576, "much": 577, "role": 578, "especially": 579, "throughout": 580, "calculations": 581, "appears": 582, "parameter": 583, "appear": 584, "calculation": 585, "doe": 586, "product": 587, "explicitly": 588, "express": 589, "regard": 590, "whose": 591, "\\\\prod": 592, "nothing": 593, "but": 594, "o_": 595, "zero": 596, "acts": 597, "conformal": 598, "equivalence": 599, "_1": 600, "_2": 601, "\\\\cup": 602, "act": 603, "characterization": 604, "critical": 605, "obvious": 606, "ingredient": 607, "obviou": 608, "since": 609, "\\\\iff": 610, "remarks": 611, "concerning": 612, "banach": 613, "make": 614, "evaluating": 615, "sense": 616, "need": 617, "take": 618, "least": 619, "completion": 620, "lies": 621, "continuous": 622, "actually": 623, "dupsilon": 624, "topology": 625, "depend": 626, "should": 627, "chosen": 628, "sufficiently": 629, "large": 630, "apply": 631, "sard": 632, "smale": 633, "borrow": 634, "details": 635, "refer": 636, "readers": 637, "thereto": 638, "7": 639, "mcd": 640, "sal04": 641, "continuou": 642, "detail": 643, "lie": 644, "reader": 645, "these": 646, "settings": 647, "during": 648, "without": 649, "explicit": 650, "mentioning": 651, "unless": 652, "absolutely": 653, "fixed": 654, "do": 655, "write": 656, "0_": 657, "tm": 658, "t_u": 659, "simplicity": 660, "notations": 661, "linearizing": 662, "transverse": 663, "submanifold": 664, "codimension": 665, "recall": 666, "och": 667, "easy": 668, "statement": 669, "once": 670, "pick": 671, "connection": 672, "pull": 673, "elliptic": 674, "regularity": 675, "therefore": 676, "evaluations": 677, "system": 678, "equations": 679, "dbar": 680, "z_0": 681, "_0": 682, "djueta": 683, "solution": 684, "data": 685, "enough": 686, "computation": 687, "torsion": 688, "tensor": 689, "here": 690, "just": 691, "want": 692, "solve": 693, "reduced": 694, "dpt": 695, "solvability": 696, "applying": 697, "alternative": 698, "purpose": 699, "crucial": 700, "3pversus2p": 701, "emphasize": 702, "must": 703, "alone": 704, "being": 705, "w2ptotm": 706, "shown": 707, "reduction": 708, "requirement": 709, "achieved": 710, "after": 711, "restricting": 712, "utilizing": 713, "restricted": 714, "elements": 715, "onto": 716, "element": 717, "norm": 718, "induced": 719, "inner": 720, "clarification": 721, "pairing": 722, "dense": 723, "loss": 724, "generality": 725, "may": 726, "under": 727, "assumption": 728, "simplify": 729, "expression": 730, "coordinates": 731, "neighborhood": 732, "open": 733, "depending": 734, "independent": 735, "sikorav": 736, "q_": 737, "cauchy": 738, "operators": 739, "matrix": 740, "multiplication": 741, "abr": 742, "djju": 743, "pure": 744, "coordinate": 745, "equivalent": 746, "tgt": 747, "d_u": 748, "dirac": 749, "delta": 750, "\\\\delta": 751, "obtain": 752, "coker": 753, "formal": 754, "adjoint": 755, "symbol": 756, "differential": 757, "13": 758, "ho": 759, "hand": 760, "get": 761, "2b": 762, "identity": 763, "small": 764, "hypothesis": 765, "unique": 766, "continuation": 767, "conclude": 768, "contained": 769, "hypothesi": 770, "postpone": 771, "till": 772, "mentioned": 773, "distributional": 774, "know": 775, "simple0": 776, "remains": 777, "equality": 778, "comes": 779, "remain": 780, "surjectivity": 781, "existence": 782, "satisfying": 783, "ac": 784, "multiply": 785, "cut": 786, "sufficient": 787, "around": 788, "integral": 789, "finishes": 790, "claim": 791, "finite": 792, "\\\\int": 793, "finish": 794, "finally": 795, "subspace": 796, "find": 797, "indeed": 798, "projection": 799, "value": 800, "surfaces": 801, "them": 802, "geometrically": 803, "consists": 804, "orbifold": 805, "empty": 806, "negative": 807, "consist": 808, "primary": 809, "goal": 810, "tildexi": 811, "whole": 812, "was": 813, "start": 814, "append": 815, "knowing": 816, "centered": 817, "regarded": 818, "metric": 819, "fix": 820, "hermitian": 821, "already": 822, "119": 823, "polynomial": 824, "variables": 825, "coefficients": 826, "coefficient": 827, "variable": 828, "furthermore": 829, "degree": 830, "adelta": 831, "functional": 832, "near": 833, "similarly": 834, "combining": 835, "note": 836, "made": 837, "had": 838, "required": 839, "lied": 840, "concluded": 841, "cause": 842, "rest": 843, "implies": 844, "simple": 845, "decompose": 846, "defining": 847, "delxiz": 848, "dz": 849, "decomposition": 850, "dictated": 851, "delchi": 852, "instead": 853, "xi": 854, "again": 855, "using": 856, "delxi": 857, "adz": 858, "substituting": 859, "finished": 860, "\\\\implies": 861, "\\\\xi": 862, "imply": 863, "continuity": 864, "proves": 865, "before": 866, "self": 867, "intersection": 868, "\\\\cap": 869, "triples": 870, "z_1": 871, "z_2": 872, "defines": 873, "via": 874, "upsilon2": 875, "focus": 876, "proving": 877, "focu": 878, "dupsilon2": 879, "v_1": 880, "v_2": 881, "diagonal": 882, "easier": 883, "adapted": 884, "convenience": 885, "restriction": 886, "intersections": 887, "emb": 888, "imm": 889, "inj": 890, "thereof": 891, "summarize": 892, "embeddings": 893, "inequalities": 894, "satisfied": 895, "inequality": 896, "compactification": 897, "restrict": 898, "attention": 899, "6": 900, "somewhat": 901, "no": 902, "intersect": 903, "identical": 904, "rules": 905, "degeneration": 906, "rule": 907, "sequence": 908, "limit": 909, "moreover": 910, "non": 911, "isolated": 912, "coincide": 913, "every": 914, "coinciding": 915, "biholomorphic": 916, "induces": 917, "denoting": 918, "induce": 919, "conceptually": 920, "adapting": 921, "detailed": 922, "compared": 923, "choose": 924, "sections": 925, "time": 926, "use": 927, "unlike": 928, "replaced": 929, "reasoning": 930, "duplicate": 931, "t_j": 932, "t_": 933, "considering": 934, "omit": 935, "thebibliography": 936, "hls": 937, "unregularized": 938, "gradient": 939, "flow": 940, "action": 941, "comm": 942, "appl": 943, "41": 944, "1988": 945, "775": 946, "813": 947, "\\\\nabla": 948, "invent": 949, "82": 950, "1985": 951, "307": 952, "347": 953, "gs": 954, "shilov": 955, "functions": 956, "academic": 957, "press": 958, "new": 959, "york": 960, "london": 961, "1968": 962, "ormander": 963, "linera": 964, "ii": 965, "compre": 966, "studies": 967, "257": 968, "springer": 969, "verlag": 970, "1983": 971, "berlin": 972, "ht": 973, "gluing": 974, "along": 975, "branched": 976, "covered": 977, "cylinders": 978, "geom": 979, "2007": 980, "43": 981, "137": 982, "sg": 983, "0705": 984, "2074": 985, "cylinder": 986, "kontsevich": 987, "talk": 988, "conference": 989, "mirror": 990, "symmetry": 991, "topics": 992, "miami": 993, "january": 994, "2008": 995, "topic": 996, "89": 997, "1987": 998, "12": 999, "36": 1000, "ms": 1001, "salamon": 1002, "holomorpic": 1003, "colloquim": 1004, "publications": 1005, "52": 1006, "ams": 1007, "providence": 1008, "ri": 1009, "2004": 1010, "publication": 1011, "oz": 1012, "trajectories": 1013, "nodes": 1014, "scale": 1015, "dependent": 1016, "submitted": 1017, "arxiv": 1018, "0711": 1019, "4187": 1020, "node": 1021, "hodge": 1022, "integrals": 1023, "degenerate": 1024, "contributions": 1025, "commun": 1026, "phys": 1027, "208": 1028, "1999": 1029, "489": 1030, "506": 1031, "contribution": 1032, "phy": 1033, "si": 1034, "properties": 1035, "165": 1036, "189": 1037, "geometry": 1038, "audin": 1039, "lafontaine": 1040, "ed": 1041, "birkh": 1042, "auser": 1043, "basel": 1044, "1994": 1045, "sm": 1046, "infinite": 1047, "amer": 1048, "87": 1049, "1965": 1050, "861": 1051, "866": 1052, "wen": 1053, "automatic": 1054, "orbifolds": 1055, "punctured": 1056, "0802": 1057, "3842v1": 1058, "\\mathbb": 1059, "\\leftrightarrow": 1060, "\\sim": 1061, "(": 1062, "^": 1063, "{": 1064, "}": 1065, ",": 1066, "\\omega": 1067, ")": 1068, "\\geq": 1069, "=": 1070, "\\cj": 1071, ":": 1072, "\\sigma": 1073, "\\to": 1074, "\\in": 1075, "\\neq": 1076, "\\quad": 1077, "\\mbox": 1078, "\\,": 1079, "-": 1080, "\\{": 1081, "\\}": 1082, ".": 1083, "\\cm": 1084, "\\circ": 1085, "\\delbar": 1086, "\\mapsto": 1087, "\\frac": 1088, "+": 1089, "[": 1090, "]": 1091, "\\beta": 1092, "\\z": 1093, ";": 1094, "\\subset": 1095, "\\leq": 1096, ">": 1097, "u'": 1098, "\\phi": 1099, "\\hookrightarrow": 1100, "\\gamma": 1101, "\\del": 1102, "\\emptyset": 1103, "\\operatorname": 1104, "<": 1105, "2.": 1106, "\\upsilon": 1107, "\\times": 1108, "\\s": 1109, "xm": 1110, "\\lambda": 1111, "hom'": 1112, "\\cf": 1113, "\\mid": 1114, "*": 1115, "|": 1116, "\\bigcup": 1117, "\\ch": 1118, "\\;": 1119, "\\pi": 1120, "\\left": 1121, "\\eta": 1122, "\\zeta": 1123, "\\big": 1124, "\\right": 1125, "\\widetilde": 1126, "\\b": 1127, "\\nabla": 1128, "\\o": 1129, "\\xi": 1130, "\\epsilon": 1131, "\\e": 1132, "\\jj": 1133, "\\cb": 1134, "\\|": 1135, "\\cdot": 1136, "\\cong": 1137, "\\c": 1138, "\\r": 1139, "\\langle": 1140, "\\rangle": 1141, "\\alpha": 1142, "\\infty": 1143, "\\delta": 1144, "\\dagger": 1145, "\\supp": 1146, "\\setminus": 1147, "\\backslash": 1148, "\\chi": 1149, "\\equiv": 1150, "\\eqref": 1151, "\\cap": 1152, "/": 1153, "\\aut": 1154, "\\text": 1155, "1.": 1156, "values": 1157, "\\cdots": 1158, "\\sqrt": 1159, "\\bar": 1160, "0.": 1161, "\\deg": 1162, "ev": 1163, "\\ge": 1164, "\\le": 1165, "\\newcommand": 1166, "\\be": 1167, "\\ee": 1168, "\\bea": 1169, "\\eea": 1170, "\\beastar": 1171, "\\eeastar": 1172}